{
    "reviews": [
        {
            "description": "I had the privilege of being tutored by Siu Sir for Math AAHL and **achieved a 7** with his guidance. He is an exceptional teacher who is passionate about teaching and nurturing students. What makes Siu Sir stand out is his long-term commitment to my education. Over the past six years, he has been a constant source of support and inspiration. His carefully compiled past paper questions, detailed booklets, and notes for each chapter were invaluable in providing structured practice. There was a time when I almost gave up on HL math, feeling overwhelmed, but Siu Sir’s belief in me and his encouragement made all the difference. He was also incredibly flexible, always willing to offer extra classes or answer my questions outside our scheduled lessons. His explanations were always clear, insightful, and tailored to my needs, helping me confidently tackle even the most complex problems.",
            "name": "JC (2024)",
            "university": "The University of Hong Kong"
        },
        {
            "description": "Mr. Siu is hands down the best math teacher I've come across. His teaching style is crystal clear, with easy-to-follow structures and a stash of super relevant questions. What makes him truly exceptional is his strong sense of responsibility and genuine passion for tutoring. He gets a real kick out of seeing his students improve, and that enthusiasm shines through in his teaching. Thanks to his guidance, my journey through IBDP **Math AAHL has seen significant improvement**. I thoroughly enjoy his tutoring sessions every week.",
            "name": "Jasmine Yang (2023)",
            "university": "The University of Edinburgh"
        },
        {
            "description": "I had the great fortune of being tutored by Winson during my IBDP years, and I can confidently say that he played a pivotal role in my success in Math AAHL. Winson's passion for tutoring is evident in every session. What sets him apart is his unique approach to teaching, offering a flexibility that goes beyond the confines of traditional classroom learning. He possesses an innate ability to pinpoint specific areas where I needed assistance, tailoring his instruction to address my individual challenges. Winson's teaching materials are exceptional; his notes are clear, concise, and remarkably easy to grasp. One standout aspect of his support was the wealth of past paper questions he provided, meticulously sorted by topics and years. This not only allowed for comprehensive practice but also facilitated a targeted focus on weaker areas. Thanks to Winson's dedication and effective teaching methods, I not only gained a deeper understanding of the subject but also achieved a stellar **7 in Math AAHL**. I am truly grateful for his guidance and highly recommend him to anyone seeking a math tutor who goes above and beyond to ensure success.",
            "name": "Alice Gao (2022)",
            "university": "University College London"
        },
        {
            "description": "I’d say that Winson is the best math tutor I’ve ever had. I had him as my tutor for the last year of IBDP. Winson’s teaching style is based on experience: his insistence on learning by practicing past papers is sensible and practical. He provides specific past paper questions for each topic separately, and his notes are very useful for final exam revisions. Winson is very patient and experienced. His assignments are based on each student’s ability and needs. In the end, Winson successfully helped me reach a **grade 7 for Math AAHL**. Definitely a good choice to find him for math tutorials!!",
            "name": "Joy Angela Sun (2022)",
            "university": "The Chinese University of Hong Kong"
        },
        {
            "description": "Winson was the first and only Math tutor who supervised me throughout my IBDP. We started regular tuition in 2019. He is patient, organised and supportive, and his notes and revision material are of great help in exam conditions! With his help, I achieved a **grade 7 in Math AAHL**.",
            "name": "Vera Jing (2021)",
            "university": "University College London"
        },
        {
            "description": "Mr. Siu is the best math teacher I have ever had. Under his guidance, **I achieved a 7 in Maths AA SL**. While I wasn't struggling to the point of needing a tutor, I sought his help to secure a solid 7, not just a borderline grade that could have been a 6. What makes him outstanding is his exceptionally clear explanations, particularly for calculus. His resources are comprehensive, offering targeted exercises and past papers dating back to the 2000s, which was an incredibly valuable surprise. He also served as a great motivator, encouraging me to complete past papers and homework when my own drive was low. Furthermore, with the support of his colleague, I scored a 6 on my Internal Assessment. I am deeply grateful for the guidance both of them provided throughout my IA, from helping me decide on a research question to refining the mathematical content. I truly would not have achieved these results without them.",
            "name": "Jason Yeung (2025)",
            "university": "The University of Hong Kong"
        },
        {
            "description": "上Winson的课真的让我的数学成绩突飞猛进。从刚开始看到数学题就头疼不知道怎么解题，通过Winson非常高效的教学方式，让我找到了解题的窍门，对于难度较高的题也能得心应手。Winson的课都是以网课形式，可能会有人顾虑网课的效率偏低，但其实根本不需要担心这类的问题。我从第一节课开始就一直觉得上课非常有效率，Winson会根据我学习的情况，来决定我今天的课是预习还是巩固知识。他讲的知识点都很简短有力，没有任何水的成分，非常简单易懂，让我这种从以前数学就不好的人进步迅速。而且他的教学效率让我在老师讲课前好几周就能完全预习好课程，所以我在上学校的课时一般都在刷Winson给我的作业（past paper和易错题）。所以我非常感谢Winson，让我最后IB大考的AASL数学成绩提高这么多！",
            "name": "Kathy Ye (2024)",
            "university": "The University of Hong Kong"
        },
        {
            "description": "Winson’s explanations are clear and easy to understand. He patiently guides you through any concepts you find challenging. His uplifting and kind demeanor makes learning enjoyable, and he’s always willing to answer your questions even outside of lesson time. I highly recommend him, especially in contrast to the rigid teaching methods of some school teachers. I couldn't have achieved a **grade 7 in Math SL** without him.",
            "name": "Kitty Lam (2020)",
            "university": "Loughborough University"
        },
        {
            "description": "Winson’s tutoring program is a one of a kind! With his guidance and problem solving strategies I was able to significantly improve my mathematical skills. He is very capable and effective not only in helping me understand complex mathematical concepts but also shortcuts to improve my problem solving speed. An often overlooked quality of a tutor is being able to motivate his students. I feel like Winson has the ability to make me demand more from myself and reach my expectations. His tutoring methodology and precise communication is truly vital to me for reaching a final score of **7 in Math AIHL**.",
            "name": "Ethan Chan (2022)",
            "university": "The University of Hong Kong"
        },
        {
            "description": "Winson老师的教学方式以习题练习为主，不断加强记忆深入了解知识点，在课后也会有相应的笔记供学生复习。老师一直很用心，包括备课/考前准备等，性格也很热情，教课不死板而且认真，帮助我在IGCSE阶段从F到A得到了提升和飞跃，其中老师量身定做了往年习题易错题以及薄弱知识点单元等，让我得到了很大的帮助。",
            "name": "Cissie Ching (2023)",
            "university": ""
        },
        {
            "description": "Finding Winson as my IBDP Math tutor was an incredible stroke of luck! He truly saved me from my struggles with IBDP Math HL, where I couldn't even pass the exam. Thanks to Winson's invaluable support, I achieved a grade 4, just a hair's breadth away from a grade 5. I am immensely grateful to him for his exceptional teaching style, which is both enjoyable and easily understandable. His fluency in Mandarin, English, and Cantonese was a tremendous asset, as it allowed me to learn in the language I felt most comfortable with. I would recommend him to everyone who is currently suffering from IBDP Math!",
            "name": "Vivian Chen (2018)",
            "university": "Istituto Marangoni London"
        },
        {
            "description": "Winson helped me a lot in my IBDP Math SL journey. My grades improved **from 4 to 7 for exams**, which was enough to get me into HKU Dentistry. His teaching style and the “by topic” past paper question bank is highly recommended for those who are seeking to improve their grades and succeed in IBDP mathematics.",
            "name": "David Zhang (2020)",
            "university": "The University of Hong Kong"
        },
        {
            "description": "Winson's tutoring helped me immensely during the period of the Covid online class, which enabled me to obtain a Predicted **Grade 7 in IBDP Math AAHL** and dreamed university offers. Especially for someone who wasn't exactly an active learner, I was able to follow his path and finish all the assignment/past papers. The lesson notes he provided with comprehensively detailed formula and key words have been a major source for revision material in every quiz, test and IBDP Exam  ><",
            "name": "Judy Wei (2021)",
            "university": "The Chinese University of Hong Kong"
        },
        {
            "description": "我认为Winson教学方法简洁明了，令人头疼且复杂的数学概念，通过老师的讲解变得十分易于理解。我的疑问都得到了耐心的解答，并且给予了我很多实用的解题技巧及策略。通过他的辅导，我在数学领域的进步与日俱增，并最终在考试中取得了优异的成绩。我非常感激他的帮助，他是一位十分出色的数学老师！",
            "name": "Coco Cheng (2024)",
            "university": "University College London"
        },
        {
            "description": "Winson has a unique teaching approach that I greatly admire. During his classes, he presents topics in his own distinctive way, which differs significantly from the school's standard teaching methods. Additionally, Winson diligently compiles valuable past paper questions for practice before and after each class, a task that often takes him several days to complete. Working closely with Winson has been instrumental in helping me **maintain an A* throughout my A-Level studies**.",
            "name": "Ken Chen (2024)",
            "university": "University College London"
        },
        {
            "description": "Winson has helped me improve my math in just one year. He gives me many past papers to do on different topics, and it has improved my math scores drastically. During our lessons, we go through many exercises and questions and I am able to learn a lot. I now have more confidence in math thanks to Winson.",
            "name": "Nicole Li (2024)",
            "university": ""
        },
        {
            "description": "Winson老师非常厉害！老师在我整个IBDP期间为我提供了很多帮助。通过他的数学补课，我得以从最初难堪的分数，提升至我个人十分满意的成绩！在往后的大学课程中，老师也都不遗余力地辅导我拿到了很好的成绩！IBDP Math不管是SL或者HL都可以放心的交给Winson老师辅导！🤩🤩",
            "name": "Connie Feng (2021)",
            "university": "The Hong Kong University of Science and Technology"
        },
        {
            "description": "Winson is a great Math Tutor who is able to break down concepts easily and apply his learning into practical exam questions. He carefully procures exam questions in a neatly formatted workbook full of practice questions for every lesson. I personally find his way of teaching to be passionate and careful, and as a result, was able to do my best in IBDP Math SL.",
            "name": "Aidan Cheung (2019)",
            "university": "The University of Warwick"
        },
        {
            "description": "Winson is a patient tutor and is well prepared for every lesson which maximises the time spent in class. He provides a lot of past paper questions and different tips that has well equipped me for my IBDP exams. I got **a 6 in Math AISL** and couldn’t have done it without him.",
            "name": "Jasmine Hung (2023)",
            "university": "University of Westminster"
        },
        {
            "description": "我是從Form 6開始上Winson的HKDSE數學課，他非常溫柔且細致，每次上課他都會針對不同的課題提供筆記和試題，並且逐一拆解和分析我的每道錯題，確保我明白題目背後的底層邏輯，讓我下次遇到類似的題目時有清晰的解題思路。不僅如此，由于時間緊迫，他還會提供MC和Short Questions不同題型的考試技巧，以及數學公式的匯總。在Winson短短6個月的幫助下，我的Math Core成績提升了兩個等級！如果沒有他的細心輔導，我的數學不會有這麽大的進步！真的很贊👍🏻",
            "name": "Lucy Han (2019)",
            "university": "The Hong Kong University of Science and Technology"
        },
        {
            "description": "I took Winson’s class for over a year and his teaching is definitely one of the best! His classes were super worth it and certainly enhanced my math performance in high school. Highly recommended!",
            "name": "Kahlina Lam (2020)",
            "university": ""
        },
        {
            "description": "Winson老师是一位满怀责任心的数学老师。他会在课堂中先带领我学习及总结单元知识，接下来将挑选合适的题目以供我练习。如果期间有任何不解，老师都会针对性地进行详细的讲解。一节课中70%时间学生做题；30%时间老师讲课，这是Winson老师独特的教学方式。Winson老师亦会在课后为我整理好Past Paper Booklet，以便我课后进行复习及巩固。在老师的帮助下，我**每次的数学AASL考试皆取得了6-7的分数**。",
            "name": "CL (2023)",
            "university": "The University of Hong Kong"
        }
    ]
}